var historyScoresData = {
  "北京大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "681",
        "rank": "3"
      },
      "普通类理工": {
        "count": "2",
        "score": "698",
        "rank": "2"
      }
    }
  },
  "中国人民大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "663",
        "rank": "14"
      },
      "普通类理工": {
        "count": "4",
        "score": "675",
        "rank": "54"
      }
    }
  },
  "清华大学": {
    "2025": {
      "普通类理工": {
        "count": "4",
        "score": "693",
        "rank": "6"
      }
    }
  },
  "北京交通大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "573",
        "rank": "478"
      },
      "普通类理工": {
        "count": "8",
        "score": "596",
        "rank": "1106"
      }
    }
  },
  "北京工业大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "585",
        "rank": "1335"
      }
    }
  },
  "北京航空航天大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "609",
        "rank": "190"
      },
      "普通类理工": {
        "count": "6",
        "score": "668",
        "rank": "98"
      }
    }
  },
  "北京理工大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "599",
        "rank": "253"
      },
      "普通类理工": {
        "count": "8",
        "score": "654",
        "rank": "219"
      }
    }
  },
  "北京科技大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "607",
        "rank": "913"
      }
    }
  },
  "北方工业大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "457",
        "rank": "2322"
      }
    }
  },
  "北京化工大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "526",
        "rank": "1093"
      },
      "普通类理工": {
        "count": "5",
        "score": "598",
        "rank": "1048"
      }
    }
  },
  "北京工商大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "485",
        "rank": "1805"
      },
      "普通类理工": {
        "count": "12",
        "score": "551",
        "rank": "2065"
      }
    }
  },
  "北京服装学院": {
    "2025": {
      "艺术类文史": {
        "count": "10",
        "score": "389",
        "rank": "3681"
      },
      "艺术类理工": {
        "count": "1",
        "score": "362",
        "rank": "5149"
      }
    }
  },
  "北京邮电大学": {
    "2025": {
      "普通类理工": {
        "count": "11",
        "score": "626",
        "rank": "576"
      }
    }
  },
  "北京建筑大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "472",
        "rank": "1999"
      },
      "普通类理工": {
        "count": "3",
        "score": "542",
        "rank": "2253"
      }
    }
  },
  "中国农业大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "611",
        "rank": "828"
      }
    }
  },
  "北京林业大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "537",
        "rank": "917"
      },
      "普通类理工": {
        "count": "4",
        "score": "569",
        "rank": "1699"
      }
    }
  },
  "首都医科大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "612",
        "rank": "813"
      }
    }
  },
  "北京中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "14",
        "score": "553",
        "rank": "697"
      },
      "普通类理工": {
        "count": "15",
        "score": "579",
        "rank": "1473"
      }
    }
  },
  "北京师范大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "627",
        "rank": "103"
      },
      "普通类理工": {
        "count": "6",
        "score": "630",
        "rank": "521"
      }
    }
  },
  "首都师范大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "534",
        "rank": "952"
      },
      "普通类理工": {
        "count": "3",
        "score": "577",
        "rank": "1515"
      }
    }
  },
  "首都体育学院": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "454",
        "rank": "2379"
      },
      "普通类理工": {
        "count": "1",
        "score": "462",
        "rank": "3768"
      },
      "体育类文史": {
        "count": "1",
        "score": "386",
        "rank": "3716"
      }
    }
  },
  "北京外国语大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "581",
        "rank": "404"
      },
      "普通类理工": {
        "count": "2",
        "score": "591",
        "rank": "1203"
      }
    }
  },
  "北京第二外国语学院": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "516",
        "rank": "1252"
      }
    }
  },
  "北京语言大学": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "527",
        "rank": "1081"
      },
      "普通类理工": {
        "count": "3",
        "score": "563",
        "rank": "1809"
      }
    }
  },
  "中国传媒大学": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "578",
        "rank": "438"
      },
      "普通类理工": {
        "count": "5",
        "score": "601",
        "rank": "1011"
      },
      "艺术类文史": {
        "count": "10",
        "score": "424",
        "rank": "2986"
      }
    }
  },
  "中央财经大学": {
    "2025": {
      "普通类文史": {
        "count": "9",
        "score": "597",
        "rank": "266"
      },
      "普通类理工": {
        "count": "11",
        "score": "614",
        "rank": "774"
      }
    }
  },
  "对外经济贸易大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "609",
        "rank": "189"
      },
      "普通类理工": {
        "count": "5",
        "score": "609",
        "rank": "853"
      }
    }
  },
  "首都经济贸易大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "521",
        "rank": "1176"
      },
      "普通类理工": {
        "count": "3",
        "score": "570",
        "rank": "1680"
      }
    }
  },
  "外交学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "573",
        "rank": "483"
      },
      "普通类理工": {
        "count": "2",
        "score": "587",
        "rank": "1291"
      }
    }
  },
  "北京体育大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "514",
        "rank": "1283"
      },
      "体育类文史": {
        "count": "1",
        "score": "487",
        "rank": "1761"
      }
    }
  },
  "中央音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "4",
        "score": "352",
        "rank": "4227"
      }
    }
  },
  "中国音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "13",
        "score": "337",
        "rank": "4435"
      }
    }
  },
  "中央美术学院": {
    "2025": {
      "艺术类文史": {
        "count": "7",
        "score": "514",
        "rank": "1278"
      }
    }
  },
  "中央戏剧学院": {
    "2025": {
      "艺术类文史": {
        "count": "15",
        "score": "408",
        "rank": "3323"
      },
      "艺术类理工": {
        "count": "1",
        "score": "388",
        "rank": "4872"
      }
    }
  },
  "北京电影学院": {
    "2025": {
      "艺术类文史": {
        "count": "3",
        "score": "418",
        "rank": "3090"
      }
    }
  },
  "北京舞蹈学院": {
    "2025": {
      "艺术类文史": {
        "count": "11",
        "score": "368",
        "rank": "4006"
      }
    }
  },
  "中央民族大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "562",
        "rank": "604"
      },
      "普通类理工": {
        "count": "5",
        "score": "599",
        "rank": "1042"
      },
      "艺术类理工": {
        "count": "1",
        "score": "446",
        "rank": "4011"
      }
    }
  },
  "中国政法大学": {
    "2025": {
      "普通类文史": {
        "count": "50",
        "score": "585",
        "rank": "365"
      },
      "普通类理工": {
        "count": "20",
        "score": "597",
        "rank": "1088"
      }
    }
  },
  "华北电力大学(北京)": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "555",
        "rank": "675"
      },
      "普通类理工": {
        "count": "4",
        "score": "575",
        "rank": "1546"
      }
    }
  },
  "南开大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "607",
        "rank": "198"
      },
      "普通类理工": {
        "count": "4",
        "score": "630",
        "rank": "523"
      }
    }
  },
  "天津大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "601",
        "rank": "234"
      },
      "普通类理工": {
        "count": "8",
        "score": "630",
        "rank": "524"
      }
    }
  },
  "天津科技大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "455",
        "rank": "2365"
      },
      "普通类理工": {
        "count": "3",
        "score": "538",
        "rank": "2338"
      }
    }
  },
  "天津工业大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "544",
        "rank": "2208"
      }
    }
  },
  "中国民航大学": {
    "2025": {
      "普通类理工": {
        "count": "3",
        "score": "571",
        "rank": "1648"
      }
    }
  },
  "天津农学院": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "461",
        "rank": "3771"
      }
    }
  },
  "天津中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "484",
        "rank": "1822"
      },
      "普通类理工": {
        "count": "9",
        "score": "530",
        "rank": "2488"
      }
    }
  },
  "天津师范大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "442",
        "rank": "2624"
      },
      "普通类理工": {
        "count": "3",
        "score": "514",
        "rank": "2807"
      }
    }
  },
  "天津外国语大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "458",
        "rank": "2284"
      }
    }
  },
  "天津商业大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "451",
        "rank": "2424"
      },
      "普通类理工": {
        "count": "2",
        "score": "490",
        "rank": "3273"
      }
    }
  },
  "天津体育学院": {
    "2025": {
      "体育类文史": {
        "count": "3",
        "score": "348",
        "rank": "4277"
      }
    }
  },
  "天津音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "5",
        "score": "339",
        "rank": "4399"
      }
    }
  },
  "天津美术学院": {
    "2025": {
      "艺术类文史": {
        "count": "5",
        "score": "439",
        "rank": "2677"
      }
    }
  },
  "河北大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "462",
        "rank": "2206"
      },
      "普通类理工": {
        "count": "2",
        "score": "521",
        "rank": "2652"
      }
    }
  },
  "华北电力大学(保定)": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "602",
        "rank": "993"
      }
    }
  },
  "河北工业大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "563",
        "rank": "1803"
      }
    }
  },
  "河北科技大学": {
    "2025": {
      "普通类理工": {
        "count": "4",
        "score": "464",
        "rank": "3713"
      }
    }
  },
  "河北农业大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "434",
        "rank": "2789"
      },
      "普通类理工": {
        "count": "3",
        "score": "498",
        "rank": "3120"
      }
    }
  },
  "河北医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "496",
        "rank": "3155"
      }
    }
  },
  "河北师范大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "451",
        "rank": "2432"
      },
      "普通类理工": {
        "count": "3",
        "score": "499",
        "rank": "3116"
      }
    }
  },
  "山西大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "495",
        "rank": "1616"
      },
      "普通类理工": {
        "count": "3",
        "score": "571",
        "rank": "1640"
      }
    }
  },
  "中北大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "451",
        "rank": "2443"
      },
      "普通类理工": {
        "count": "3",
        "score": "548",
        "rank": "2127"
      }
    }
  },
  "太原理工大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "582",
        "rank": "1407"
      }
    }
  },
  "山西医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "509",
        "rank": "2901"
      }
    }
  },
  "山西师范大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "442",
        "rank": "2621"
      }
    }
  },
  "辽宁大学": {
    "2025": {
      "普通类文史": {
        "count": "9",
        "score": "506",
        "rank": "1417"
      },
      "普通类理工": {
        "count": "21",
        "score": "538",
        "rank": "2332"
      }
    }
  },
  "大连理工大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "558",
        "rank": "646"
      },
      "普通类理工": {
        "count": "9",
        "score": "617",
        "rank": "720"
      }
    }
  },
  "沈阳工业大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "441",
        "rank": "2644"
      },
      "普通类理工": {
        "count": "3",
        "score": "534",
        "rank": "2400"
      }
    }
  },
  "沈阳航空航天大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "463",
        "rank": "2183"
      },
      "普通类理工": {
        "count": "4",
        "score": "546",
        "rank": "2179"
      }
    }
  },
  "东北大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "522",
        "rank": "1161"
      },
      "普通类理工": {
        "count": "8",
        "score": "589",
        "rank": "1253"
      }
    }
  },
  "大连海事大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "533",
        "rank": "978"
      },
      "普通类理工": {
        "count": "3",
        "score": "580",
        "rank": "1457"
      }
    }
  },
  "中国医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "560",
        "rank": "1864"
      }
    }
  },
  "大连医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "532",
        "rank": "2457"
      }
    }
  },
  "辽宁中医药大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "468",
        "rank": "3649"
      }
    }
  },
  "沈阳药科大学": {
    "2025": {
      "普通类理工": {
        "count": "15",
        "score": "473",
        "rank": "3590"
      }
    }
  },
  "东北财经大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "516",
        "rank": "1256"
      }
    }
  },
  "吉林大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "559",
        "rank": "628"
      },
      "普通类理工": {
        "count": "10",
        "score": "606",
        "rank": "917"
      }
    }
  },
  "东北师范大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "533",
        "rank": "980"
      },
      "普通类理工": {
        "count": "1",
        "score": "584",
        "rank": "1377"
      }
    }
  },
  "黑龙江大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "461",
        "rank": "2210"
      },
      "普通类理工": {
        "count": "2",
        "score": "535",
        "rank": "2377"
      }
    }
  },
  "哈尔滨工业大学": {
    "2025": {
      "普通类文史": {
        "count": "7",
        "score": "606",
        "rank": "214"
      },
      "普通类理工": {
        "count": "8",
        "score": "666",
        "rank": "106"
      }
    }
  },
  "燕山大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "469",
        "rank": "2065"
      },
      "普通类理工": {
        "count": "2",
        "score": "559",
        "rank": "1886"
      }
    }
  },
  "哈尔滨工程大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "594",
        "rank": "1146"
      }
    }
  },
  "东北石油大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "477",
        "rank": "3526"
      }
    }
  },
  "东北林业大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "527",
        "rank": "2562"
      }
    }
  },
  "黑龙江中医药大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "466",
        "rank": "3692"
      }
    }
  },
  "复旦大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "668",
        "rank": "8"
      },
      "普通类理工": {
        "count": "8",
        "score": "681",
        "rank": "27"
      }
    }
  },
  "同济大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "642",
        "rank": "49"
      },
      "普通类理工": {
        "count": "13",
        "score": "664",
        "rank": "121"
      }
    }
  },
  "上海交通大学": {
    "2025": {
      "普通类理工": {
        "count": "17",
        "score": "678",
        "rank": "44"
      }
    }
  },
  "华东理工大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "553",
        "rank": "701"
      },
      "普通类理工": {
        "count": "17",
        "score": "604",
        "rank": "957"
      }
    }
  },
  "上海理工大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "528",
        "rank": "1054"
      },
      "普通类理工": {
        "count": "3",
        "score": "569",
        "rank": "1705"
      }
    }
  },
  "东华大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "542",
        "rank": "855"
      },
      "普通类理工": {
        "count": "5",
        "score": "591",
        "rank": "1207"
      }
    }
  },
  "上海应用技术大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "461",
        "rank": "2226"
      },
      "普通类理工": {
        "count": "2",
        "score": "542",
        "rank": "2254"
      }
    }
  },
  "上海健康医学院": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "483",
        "rank": "3401"
      }
    }
  },
  "上海海洋大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "525",
        "rank": "1105"
      },
      "普通类理工": {
        "count": "3",
        "score": "573",
        "rank": "1601"
      }
    }
  },
  "上海中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "550",
        "rank": "744"
      },
      "普通类理工": {
        "count": "12",
        "score": "564",
        "rank": "1796"
      }
    }
  },
  "华东师范大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "609",
        "rank": "185"
      },
      "普通类理工": {
        "count": "8",
        "score": "621",
        "rank": "661"
      }
    }
  },
  "上海师范大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "521",
        "rank": "1167"
      },
      "普通类理工": {
        "count": "7",
        "score": "555",
        "rank": "1989"
      }
    }
  },
  "上海外国语大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "578",
        "rank": "436"
      },
      "普通类理工": {
        "count": "3",
        "score": "598",
        "rank": "1080"
      }
    }
  },
  "上海财经大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "627",
        "rank": "104"
      },
      "普通类理工": {
        "count": "10",
        "score": "623",
        "rank": "631"
      }
    }
  },
  "上海对外经贸大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "526",
        "rank": "1096"
      },
      "普通类理工": {
        "count": "4",
        "score": "574",
        "rank": "1581"
      }
    }
  },
  "华东政法大学": {
    "2025": {
      "普通类文史": {
        "count": "18",
        "score": "574",
        "rank": "476"
      },
      "普通类理工": {
        "count": "10",
        "score": "582",
        "rank": "1401"
      }
    }
  },
  "上海体育大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "525",
        "rank": "1116"
      },
      "普通类理工": {
        "count": "1",
        "score": "532",
        "rank": "2458"
      },
      "体育类文史": {
        "count": "2",
        "score": "450",
        "rank": "2461"
      }
    }
  },
  "上海音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "5",
        "score": "391",
        "rank": "3653"
      }
    }
  },
  "上海戏剧学院": {
    "2025": {
      "艺术类文史": {
        "count": "5",
        "score": "332",
        "rank": "4490"
      }
    }
  },
  "上海大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "580",
        "rank": "415"
      },
      "普通类理工": {
        "count": "8",
        "score": "607",
        "rank": "903"
      }
    }
  },
  "南京大学": {
    "2025": {
      "普通类文史": {
        "count": "20",
        "score": "642",
        "rank": "50"
      },
      "普通类理工": {
        "count": "12",
        "score": "668",
        "rank": "95"
      }
    }
  },
  "苏州大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "553",
        "rank": "704"
      },
      "普通类理工": {
        "count": "5",
        "score": "604",
        "rank": "953"
      }
    }
  },
  "东南大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "600",
        "rank": "239"
      },
      "普通类理工": {
        "count": "28",
        "score": "637",
        "rank": "414"
      }
    }
  },
  "南京航空航天大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "549",
        "rank": "760"
      },
      "普通类理工": {
        "count": "11",
        "score": "613",
        "rank": "793"
      }
    }
  },
  "南京理工大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "539",
        "rank": "887"
      },
      "普通类理工": {
        "count": "7",
        "score": "611",
        "rank": "815"
      }
    }
  },
  "江苏科技大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "464",
        "rank": "2157"
      },
      "普通类理工": {
        "count": "10",
        "score": "554",
        "rank": "1998"
      }
    }
  },
  "中国矿业大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "528",
        "rank": "1055"
      }
    }
  },
  "南京工业大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "493",
        "rank": "1647"
      },
      "普通类理工": {
        "count": "2",
        "score": "552",
        "rank": "2047"
      }
    }
  },
  "常州大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "479",
        "rank": "1888"
      },
      "普通类理工": {
        "count": "2",
        "score": "550",
        "rank": "2100"
      }
    }
  },
  "南京邮电大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "532",
        "rank": "984"
      },
      "普通类理工": {
        "count": "5",
        "score": "598",
        "rank": "1063"
      }
    }
  },
  "河海大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "533",
        "rank": "966"
      },
      "普通类理工": {
        "count": "4",
        "score": "583",
        "rank": "1388"
      }
    }
  },
  "江南大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "544",
        "rank": "818"
      },
      "普通类理工": {
        "count": "3",
        "score": "602",
        "rank": "987"
      }
    }
  },
  "南京林业大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "496",
        "rank": "1594"
      }
    }
  },
  "江苏大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "503",
        "rank": "1465"
      },
      "普通类理工": {
        "count": "7",
        "score": "574",
        "rank": "1598"
      }
    }
  },
  "南京信息工程大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "588",
        "rank": "1271"
      }
    }
  },
  "南通大学": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "487",
        "rank": "1777"
      },
      "普通类理工": {
        "count": "23",
        "score": "547",
        "rank": "2152"
      }
    }
  },
  "南京农业大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "567",
        "rank": "1731"
      }
    }
  },
  "南京医科大学": {
    "2025": {
      "普通类理工": {
        "count": "29",
        "score": "557",
        "rank": "1943"
      }
    }
  },
  "徐州医科大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "520",
        "rank": "2686"
      }
    }
  },
  "南京中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "30",
        "score": "511",
        "rank": "1325"
      },
      "普通类理工": {
        "count": "23",
        "score": "549",
        "rank": "2103"
      },
      "预科文史": {
        "count": "0",
        "score": "0",
        "rank": "0"
      },
      "预科理工": {
        "count": "1",
        "score": "514",
        "rank": "2792"
      }
    }
  },
  "中国药科大学": {
    "2025": {
      "普通类理工": {
        "count": "6",
        "score": "581",
        "rank": "1436"
      }
    }
  },
  "南京师范大学": {
    "2025": {
      "普通类文史": {
        "count": "28",
        "score": "541",
        "rank": "857"
      },
      "普通类理工": {
        "count": "6",
        "score": "595",
        "rank": "1117"
      },
      "艺术类文史": {
        "count": "1",
        "score": "445",
        "rank": "2559"
      }
    }
  },
  "南京财经大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "497",
        "rank": "1572"
      },
      "普通类理工": {
        "count": "10",
        "score": "554",
        "rank": "2006"
      }
    }
  },
  "浙江大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "666",
        "rank": "11"
      },
      "普通类理工": {
        "count": "4",
        "score": "677",
        "rank": "45"
      }
    }
  },
  "杭州电子科技大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "507",
        "rank": "1396"
      },
      "普通类理工": {
        "count": "16",
        "score": "580",
        "rank": "1460"
      }
    }
  },
  "浙江工业大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "523",
        "rank": "1145"
      },
      "普通类理工": {
        "count": "10",
        "score": "579",
        "rank": "1476"
      }
    }
  },
  "浙江理工大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "490",
        "rank": "1710"
      },
      "普通类理工": {
        "count": "17",
        "score": "567",
        "rank": "1732"
      }
    }
  },
  "浙江海洋大学": {
    "2025": {
      "普通类文史": {
        "count": "11",
        "score": "469",
        "rank": "2060"
      },
      "普通类理工": {
        "count": "11",
        "score": "528",
        "rank": "2532"
      }
    }
  },
  "温州医科大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "543",
        "rank": "2242"
      }
    }
  },
  "浙江中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "505",
        "rank": "1425"
      },
      "普通类理工": {
        "count": "3",
        "score": "545",
        "rank": "2187"
      }
    }
  },
  "浙江师范大学": {
    "2025": {
      "普通类文史": {
        "count": "33",
        "score": "490",
        "rank": "1704"
      },
      "普通类理工": {
        "count": "10",
        "score": "550",
        "rank": "2097"
      }
    }
  },
  "杭州师范大学": {
    "2025": {
      "普通类理工": {
        "count": "3",
        "score": "549",
        "rank": "2105"
      },
      "艺术类文史": {
        "count": "1",
        "score": "429",
        "rank": "2900"
      }
    }
  },
  "温州大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "488",
        "rank": "1750"
      },
      "普通类理工": {
        "count": "5",
        "score": "556",
        "rank": "1952"
      }
    }
  },
  "丽水学院": {
    "2025": {
      "普通类文史": {
        "count": "13",
        "score": "447",
        "rank": "2509"
      },
      "普通类理工": {
        "count": "9",
        "score": "498",
        "rank": "3124"
      }
    }
  },
  "浙江工商大学": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "500",
        "rank": "1533"
      },
      "普通类理工": {
        "count": "3",
        "score": "560",
        "rank": "1865"
      }
    }
  },
  "嘉兴大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "483",
        "rank": "1830"
      },
      "普通类理工": {
        "count": "3",
        "score": "533",
        "rank": "2428"
      }
    }
  },
  "中国美术学院": {
    "2025": {
      "艺术类文史": {
        "count": "22",
        "score": "482",
        "rank": "1834"
      }
    }
  },
  "中国计量大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "498",
        "rank": "1551"
      },
      "普通类理工": {
        "count": "2",
        "score": "567",
        "rank": "1734"
      }
    }
  },
  "安徽大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "576",
        "rank": "1541"
      }
    }
  },
  "中国科学技术大学": {
    "2025": {
      "普通类理工": {
        "count": "2",
        "score": "675",
        "rank": "51"
      }
    }
  },
  "合肥工业大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "523",
        "rank": "1146"
      },
      "普通类理工": {
        "count": "4",
        "score": "598",
        "rank": "1061"
      }
    }
  },
  "安徽农业大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "460",
        "rank": "2250"
      },
      "普通类理工": {
        "count": "7",
        "score": "499",
        "rank": "3098"
      }
    }
  },
  "安徽中医药大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "489",
        "rank": "3295"
      }
    }
  },
  "安徽师范大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "459",
        "rank": "2279"
      },
      "普通类理工": {
        "count": "12",
        "score": "468",
        "rank": "3661"
      }
    }
  },
  "厦门大学": {
    "2025": {
      "普通类文史": {
        "count": "40",
        "score": "610",
        "rank": "179"
      },
      "普通类理工": {
        "count": "60",
        "score": "625",
        "rank": "595"
      }
    }
  },
  "华侨大学": {
    "2025": {
      "普通类文史": {
        "count": "140",
        "score": "473",
        "rank": "1985"
      },
      "普通类理工": {
        "count": "140",
        "score": "532",
        "rank": "2440"
      },
      "艺术类文史": {
        "count": "10",
        "score": "413",
        "rank": "3195"
      },
      "艺术类理工": {
        "count": "8",
        "score": "388",
        "rank": "4876"
      },
      "体育类文史": {
        "count": "1",
        "score": "444",
        "rank": "2581"
      },
      "预科文史": {
        "count": "8",
        "score": "452",
        "rank": "2421"
      },
      "预科理工": {
        "count": "12",
        "score": "505",
        "rank": "2978"
      }
    }
  },
  "福州大学": {
    "2025": {
      "普通类文史": {
        "count": "34",
        "score": "536",
        "rank": "932"
      },
      "普通类理工": {
        "count": "30",
        "score": "589",
        "rank": "1241"
      },
      "艺术类文史": {
        "count": "6",
        "score": "422",
        "rank": "3028"
      }
    }
  },
  "福建农林大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "475",
        "rank": "1946"
      },
      "普通类理工": {
        "count": "5",
        "score": "524",
        "rank": "2618"
      }
    }
  },
  "集美大学": {
    "2025": {
      "普通类文史": {
        "count": "61",
        "score": "474",
        "rank": "1974"
      },
      "普通类理工": {
        "count": "63",
        "score": "525",
        "rank": "2587"
      },
      "艺术类文史": {
        "count": "16",
        "score": "382",
        "rank": "3790"
      },
      "体育类文史": {
        "count": "4",
        "score": "391",
        "rank": "3656"
      },
      "预科文史": {
        "count": "10",
        "score": "448",
        "rank": "2489"
      },
      "预科理工": {
        "count": "10",
        "score": "501",
        "rank": "3063"
      }
    }
  },
  "福建医科大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "560",
        "rank": "1878"
      },
      "预科文史": {
        "count": "0",
        "score": "0",
        "rank": "0"
      },
      "预科理工": {
        "count": "1",
        "score": "508",
        "rank": "2929"
      }
    }
  },
  "福建中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "9",
        "score": "490",
        "rank": "1709"
      },
      "普通类理工": {
        "count": "9",
        "score": "515",
        "rank": "2780"
      },
      "预科文史": {
        "count": "1",
        "score": "453",
        "rank": "2396"
      },
      "预科理工": {
        "count": "1",
        "score": "500",
        "rank": "3096"
      }
    }
  },
  "福建师范大学": {
    "2025": {
      "普通类文史": {
        "count": "52",
        "score": "498",
        "rank": "1557"
      },
      "普通类理工": {
        "count": "23",
        "score": "559",
        "rank": "1906"
      },
      "艺术类文史": {
        "count": "10",
        "score": "416",
        "rank": "3149"
      },
      "预科文史": {
        "count": "1",
        "score": "457",
        "rank": "2314"
      },
      "预科理工": {
        "count": "1",
        "score": "518",
        "rank": "2720"
      }
    }
  },
  "武夷学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "441",
        "rank": "2630"
      },
      "普通类理工": {
        "count": "3",
        "score": "512",
        "rank": "2839"
      }
    }
  },
  "宁德师范学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "461",
        "rank": "2229"
      },
      "普通类理工": {
        "count": "3",
        "score": "506",
        "rank": "2969"
      }
    }
  },
  "泉州师范学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "460",
        "rank": "2257"
      },
      "普通类理工": {
        "count": "3",
        "score": "505",
        "rank": "2985"
      }
    }
  },
  "闽南师范大学": {
    "2025": {
      "普通类文史": {
        "count": "20",
        "score": "466",
        "rank": "2121"
      },
      "普通类理工": {
        "count": "23",
        "score": "509",
        "rank": "2926"
      },
      "艺术类文史": {
        "count": "2",
        "score": "367",
        "rank": "4013"
      }
    }
  },
  "南昌大学": {
    "2025": {
      "普通类文史": {
        "count": "120",
        "score": "512",
        "rank": "1311"
      },
      "普通类理工": {
        "count": "60",
        "score": "574",
        "rank": "1587"
      }
    }
  },
  "江西理工大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "462",
        "rank": "2196"
      },
      "普通类理工": {
        "count": "6",
        "score": "519",
        "rank": "2699"
      }
    }
  },
  "景德镇陶瓷大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "447",
        "rank": "2520"
      },
      "艺术类文史": {
        "count": "10",
        "score": "340",
        "rank": "4392"
      }
    }
  },
  "江西中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "7",
        "score": "473",
        "rank": "1980"
      },
      "普通类理工": {
        "count": "15",
        "score": "490",
        "rank": "3284"
      }
    }
  },
  "井冈山大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "477",
        "rank": "3515"
      }
    }
  },
  "江西财经大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "517",
        "rank": "1230"
      },
      "普通类理工": {
        "count": "2",
        "score": "570",
        "rank": "1686"
      }
    }
  },
  "山东大学": {
    "2025": {
      "普通类文史": {
        "count": "24",
        "score": "564",
        "rank": "578"
      },
      "普通类理工": {
        "count": "26",
        "score": "610",
        "rank": "841"
      }
    }
  },
  "中国海洋大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "560",
        "rank": "622"
      },
      "普通类理工": {
        "count": "5",
        "score": "600",
        "rank": "1026"
      }
    }
  },
  "山东科技大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "476",
        "rank": "1926"
      },
      "普通类理工": {
        "count": "4",
        "score": "554",
        "rank": "2013"
      }
    }
  },
  "中国石油大学(华东)": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "527",
        "rank": "1072"
      },
      "普通类理工": {
        "count": "3",
        "score": "573",
        "rank": "1604"
      }
    }
  },
  "青岛科技大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "459",
        "rank": "2266"
      },
      "普通类理工": {
        "count": "6",
        "score": "514",
        "rank": "2799"
      }
    }
  },
  "青岛理工大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "459",
        "rank": "2278"
      },
      "普通类理工": {
        "count": "2",
        "score": "517",
        "rank": "2743"
      }
    }
  },
  "山东建筑大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "445",
        "rank": "2563"
      }
    }
  },
  "山东中医药大学": {
    "2025": {
      "普通类理工": {
        "count": "7",
        "score": "497",
        "rank": "3133"
      },
      "预科文史": {
        "count": "0",
        "score": "0",
        "rank": "0"
      },
      "预科理工": {
        "count": "1",
        "score": "499",
        "rank": "3105"
      }
    }
  },
  "山东师范大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "451",
        "rank": "2434"
      },
      "普通类理工": {
        "count": "1",
        "score": "525",
        "rank": "2586"
      }
    }
  },
  "山东财经大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "461",
        "rank": "2222"
      },
      "普通类理工": {
        "count": "3",
        "score": "539",
        "rank": "2319"
      }
    }
  },
  "郑州大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "534",
        "rank": "958"
      },
      "普通类理工": {
        "count": "8",
        "score": "586",
        "rank": "1332"
      }
    }
  },
  "河南科技大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "441",
        "rank": "2642"
      },
      "普通类理工": {
        "count": "10",
        "score": "511",
        "rank": "2855"
      }
    }
  },
  "河南农业大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "455",
        "rank": "2358"
      },
      "普通类理工": {
        "count": "8",
        "score": "501",
        "rank": "3046"
      }
    }
  },
  "河南大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "498",
        "rank": "1568"
      },
      "普通类理工": {
        "count": "5",
        "score": "547",
        "rank": "2153"
      }
    }
  },
  "武汉大学": {
    "2025": {
      "普通类文史": {
        "count": "21",
        "score": "621",
        "rank": "126"
      },
      "普通类理工": {
        "count": "50",
        "score": "636",
        "rank": "432"
      }
    }
  },
  "华中科技大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "602",
        "rank": "227"
      },
      "普通类理工": {
        "count": "40",
        "score": "635",
        "rank": "439"
      }
    }
  },
  "武汉科技大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "462",
        "rank": "2197"
      },
      "普通类理工": {
        "count": "3",
        "score": "570",
        "rank": "1672"
      }
    }
  },
  "长江大学": {
    "2025": {
      "普通类文史": {
        "count": "17",
        "score": "462",
        "rank": "2205"
      },
      "普通类理工": {
        "count": "17",
        "score": "520",
        "rank": "2675"
      }
    }
  },
  "中国地质大学(武汉)": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "527",
        "rank": "1073"
      },
      "普通类理工": {
        "count": "20",
        "score": "581",
        "rank": "1437"
      },
      "艺术类文史": {
        "count": "1",
        "score": "386",
        "rank": "3730"
      },
      "艺术类理工": {
        "count": "1",
        "score": "463",
        "rank": "3747"
      },
      "体育类文史": {
        "count": "4",
        "score": "344",
        "rank": "4339"
      }
    }
  },
  "武汉理工大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "535",
        "rank": "939"
      },
      "普通类理工": {
        "count": "6",
        "score": "606",
        "rank": "932"
      },
      "艺术类文史": {
        "count": "2",
        "score": "431",
        "rank": "2851"
      }
    }
  },
  "湖北工业大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "454",
        "rank": "2380"
      },
      "普通类理工": {
        "count": "4",
        "score": "557",
        "rank": "1931"
      },
      "艺术类文史": {
        "count": "3",
        "score": "393",
        "rank": "3625"
      }
    }
  },
  "华中农业大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "525",
        "rank": "1104"
      },
      "普通类理工": {
        "count": "3",
        "score": "596",
        "rank": "1100"
      }
    }
  },
  "华中师范大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "563",
        "rank": "582"
      },
      "普通类理工": {
        "count": "10",
        "score": "593",
        "rank": "1161"
      }
    }
  },
  "湖北大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "503",
        "rank": "1462"
      },
      "普通类理工": {
        "count": "5",
        "score": "565",
        "rank": "1774"
      }
    }
  },
  "黄冈师范学院": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "450",
        "rank": "2447"
      },
      "普通类理工": {
        "count": "6",
        "score": "481",
        "rank": "3457"
      }
    }
  },
  "中南财经政法大学": {
    "2025": {
      "普通类文史": {
        "count": "36",
        "score": "555",
        "rank": "670"
      },
      "普通类理工": {
        "count": "35",
        "score": "580",
        "rank": "1459"
      }
    }
  },
  "湖北美术学院": {
    "2025": {
      "艺术类文史": {
        "count": "14",
        "score": "394",
        "rank": "3598"
      }
    }
  },
  "中南民族大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "487",
        "rank": "1768"
      },
      "普通类理工": {
        "count": "6",
        "score": "528",
        "rank": "2531"
      }
    }
  },
  "湘潭大学": {
    "2025": {
      "普通类文史": {
        "count": "15",
        "score": "506",
        "rank": "1418"
      },
      "普通类理工": {
        "count": "10",
        "score": "572",
        "rank": "1625"
      }
    }
  },
  "湖南大学": {
    "2025": {
      "普通类文史": {
        "count": "17",
        "score": "585",
        "rank": "366"
      },
      "普通类理工": {
        "count": "13",
        "score": "617",
        "rank": "724"
      }
    }
  },
  "中南大学": {
    "2025": {
      "普通类文史": {
        "count": "35",
        "score": "571",
        "rank": "507"
      },
      "普通类理工": {
        "count": "39",
        "score": "618",
        "rank": "713"
      }
    }
  },
  "湖南科技大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "473",
        "rank": "1987"
      },
      "普通类理工": {
        "count": "5",
        "score": "564",
        "rank": "1790"
      }
    }
  },
  "湖南农业大学": {
    "2025": {
      "普通类文史": {
        "count": "20",
        "score": "455",
        "rank": "2359"
      },
      "普通类理工": {
        "count": "30",
        "score": "461",
        "rank": "3773"
      }
    }
  },
  "湖南中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "29",
        "score": "481",
        "rank": "1864"
      },
      "普通类理工": {
        "count": "28",
        "score": "512",
        "rank": "2845"
      },
      "预科文史": {
        "count": "0",
        "score": "0",
        "rank": "0"
      },
      "预科理工": {
        "count": "1",
        "score": "505",
        "rank": "2984"
      }
    }
  },
  "湖南师范大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "541",
        "rank": "867"
      },
      "普通类理工": {
        "count": "4",
        "score": "585",
        "rank": "1352"
      }
    }
  },
  "南华大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "465",
        "rank": "2133"
      },
      "普通类理工": {
        "count": "20",
        "score": "524",
        "rank": "2617"
      }
    }
  },
  "中山大学": {
    "2025": {
      "普通类文史": {
        "count": "36",
        "score": "627",
        "rank": "108"
      },
      "普通类理工": {
        "count": "144",
        "score": "636",
        "rank": "425"
      }
    }
  },
  "暨南大学": {
    "2025": {
      "普通类文史": {
        "count": "87",
        "score": "545",
        "rank": "802"
      },
      "普通类理工": {
        "count": "104",
        "score": "589",
        "rank": "1248"
      },
      "艺术类文史": {
        "count": "5",
        "score": "427",
        "rank": "2935"
      },
      "体育类文史": {
        "count": "4",
        "score": "441",
        "rank": "2635"
      },
      "体育类理工": {
        "count": "1",
        "score": "432",
        "rank": "4233"
      },
      "预科文史": {
        "count": "2",
        "score": "503",
        "rank": "1475"
      },
      "预科理工": {
        "count": "8",
        "score": "556",
        "rank": "1945"
      }
    }
  },
  "汕头大学": {
    "2025": {
      "普通类文史": {
        "count": "9",
        "score": "533",
        "rank": "973"
      },
      "普通类理工": {
        "count": "8",
        "score": "579",
        "rank": "1465"
      },
      "艺术类文史": {
        "count": "3",
        "score": "356",
        "rank": "4171"
      }
    }
  },
  "华南理工大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "610",
        "rank": "181"
      },
      "普通类理工": {
        "count": "15",
        "score": "633",
        "rank": "473"
      }
    }
  },
  "华南农业大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "544",
        "rank": "825"
      },
      "普通类理工": {
        "count": "4",
        "score": "583",
        "rank": "1385"
      }
    }
  },
  "广东海洋大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "548",
        "rank": "2130"
      }
    }
  },
  "广州医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "580",
        "rank": "1453"
      }
    }
  },
  "广东医科大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "515",
        "rank": "1261"
      },
      "普通类理工": {
        "count": "14",
        "score": "537",
        "rank": "2352"
      }
    }
  },
  "广州中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "552",
        "rank": "711"
      },
      "普通类理工": {
        "count": "26",
        "score": "573",
        "rank": "1609"
      }
    }
  },
  "广东药科大学": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "473",
        "rank": "1990"
      },
      "普通类理工": {
        "count": "30",
        "score": "527",
        "rank": "2558"
      }
    }
  },
  "华南师范大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "574",
        "rank": "475"
      },
      "普通类理工": {
        "count": "10",
        "score": "597",
        "rank": "1084"
      }
    }
  },
  "韶关学院": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "460",
        "rank": "2247"
      },
      "普通类理工": {
        "count": "20",
        "score": "489",
        "rank": "3291"
      }
    }
  },
  "肇庆学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "478",
        "rank": "1906"
      },
      "普通类理工": {
        "count": "3",
        "score": "529",
        "rank": "2519"
      }
    }
  },
  "广州体育学院": {
    "2025": {
      "艺术类文史": {
        "count": "1",
        "score": "364",
        "rank": "4062"
      },
      "艺术类理工": {
        "count": "1",
        "score": "399",
        "rank": "4738"
      },
      "体育类文史": {
        "count": "5",
        "score": "362",
        "rank": "4085"
      }
    }
  },
  "广州美术学院": {
    "2025": {
      "普通类理工": {
        "count": "6",
        "score": "502",
        "rank": "3028"
      },
      "艺术类文史": {
        "count": "28",
        "score": "459",
        "rank": "2261"
      },
      "艺术类理工": {
        "count": "2",
        "score": "417",
        "rank": "4477"
      }
    }
  },
  "星海音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "13",
        "score": "354",
        "rank": "4205"
      }
    }
  },
  "广东技术师范大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "502",
        "rank": "1482"
      },
      "普通类理工": {
        "count": "3",
        "score": "551",
        "rank": "2066"
      }
    }
  },
  "海南大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "532",
        "rank": "992"
      },
      "普通类理工": {
        "count": "2",
        "score": "581",
        "rank": "1420"
      },
      "艺术类文史": {
        "count": "4",
        "score": "432",
        "rank": "2834"
      }
    }
  },
  "深圳大学": {
    "2025": {
      "普通类文史": {
        "count": "70",
        "score": "552",
        "rank": "721"
      },
      "普通类理工": {
        "count": "60",
        "score": "604",
        "rank": "949"
      }
    }
  },
  "广东财经大学": {
    "2025": {
      "普通类文史": {
        "count": "44",
        "score": "508",
        "rank": "1383"
      },
      "普通类理工": {
        "count": "30",
        "score": "558",
        "rank": "1921"
      }
    }
  },
  "广西大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "560",
        "rank": "1871"
      }
    }
  },
  "桂林理工大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "455",
        "rank": "2357"
      },
      "普通类理工": {
        "count": "20",
        "score": "507",
        "rank": "2940"
      }
    }
  },
  "广西医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "512",
        "rank": "2838"
      }
    }
  },
  "桂林医科大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "442",
        "rank": "2615"
      },
      "普通类理工": {
        "count": "6",
        "score": "508",
        "rank": "2930"
      }
    }
  },
  "四川大学": {
    "2025": {
      "普通类文史": {
        "count": "39",
        "score": "589",
        "rank": "331"
      },
      "普通类理工": {
        "count": "30",
        "score": "624",
        "rank": "618"
      }
    }
  },
  "重庆大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "525",
        "rank": "1110"
      },
      "普通类理工": {
        "count": "14",
        "score": "614",
        "rank": "784"
      }
    }
  },
  "西南交通大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "548",
        "rank": "772"
      },
      "普通类理工": {
        "count": "6",
        "score": "607",
        "rank": "906"
      }
    }
  },
  "电子科技大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "572",
        "rank": "487"
      },
      "普通类理工": {
        "count": "16",
        "score": "632",
        "rank": "486"
      }
    }
  },
  "重庆邮电大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "579",
        "rank": "1488"
      }
    }
  },
  "重庆交通大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "473",
        "rank": "1982"
      },
      "普通类理工": {
        "count": "4",
        "score": "551",
        "rank": "2060"
      }
    }
  },
  "西南科技大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "450",
        "rank": "2460"
      },
      "普通类理工": {
        "count": "12",
        "score": "514",
        "rank": "2808"
      }
    }
  },
  "西华大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "463",
        "rank": "2185"
      },
      "普通类理工": {
        "count": "10",
        "score": "511",
        "rank": "2867"
      }
    }
  },
  "四川农业大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "527",
        "rank": "1077"
      },
      "普通类理工": {
        "count": "5",
        "score": "570",
        "rank": "1661"
      }
    }
  },
  "重庆医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "547",
        "rank": "2159"
      }
    }
  },
  "成都中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "502",
        "rank": "1479"
      },
      "普通类理工": {
        "count": "16",
        "score": "536",
        "rank": "2365"
      },
      "预科文史": {
        "count": "0",
        "score": "0",
        "rank": "0"
      },
      "预科理工": {
        "count": "1",
        "score": "514",
        "rank": "2800"
      }
    }
  },
  "西南大学": {
    "2025": {
      "普通类文史": {
        "count": "9",
        "score": "546",
        "rank": "797"
      },
      "普通类理工": {
        "count": "6",
        "score": "591",
        "rank": "1191"
      }
    }
  },
  "四川师范大学": {
    "2025": {
      "普通类文史": {
        "count": "11",
        "score": "487",
        "rank": "1757"
      },
      "普通类理工": {
        "count": "9",
        "score": "511",
        "rank": "2876"
      }
    }
  },
  "重庆师范大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "479",
        "rank": "1883"
      },
      "普通类理工": {
        "count": "1",
        "score": "547",
        "rank": "2158"
      }
    }
  },
  "西南财经大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "567",
        "rank": "536"
      },
      "普通类理工": {
        "count": "16",
        "score": "589",
        "rank": "1236"
      }
    }
  },
  "西南政法大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "565",
        "rank": "559"
      },
      "普通类理工": {
        "count": "3",
        "score": "581",
        "rank": "1428"
      }
    }
  },
  "四川音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "7",
        "score": "367",
        "rank": "4018"
      }
    }
  },
  "四川美术学院": {
    "2025": {
      "艺术类文史": {
        "count": "39",
        "score": "415",
        "rank": "3152"
      },
      "艺术类理工": {
        "count": "1",
        "score": "391",
        "rank": "4839"
      }
    }
  },
  "西南民族大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "460",
        "rank": "2244"
      },
      "普通类理工": {
        "count": "6",
        "score": "500",
        "rank": "3093"
      }
    }
  },
  "贵州大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "516",
        "rank": "1249"
      },
      "普通类理工": {
        "count": "4",
        "score": "575",
        "rank": "1557"
      }
    }
  },
  "遵义医科大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "460",
        "rank": "2234"
      },
      "普通类理工": {
        "count": "4",
        "score": "510",
        "rank": "2894"
      }
    }
  },
  "贵州中医药大学": {
    "2025": {
      "普通类理工": {
        "count": "20",
        "score": "465",
        "rank": "3703"
      }
    }
  },
  "云南大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "532",
        "rank": "994"
      },
      "普通类理工": {
        "count": "3",
        "score": "582",
        "rank": "1410"
      }
    }
  },
  "昆明理工大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "465",
        "rank": "2142"
      },
      "普通类理工": {
        "count": "3",
        "score": "552",
        "rank": "2046"
      }
    }
  },
  "西南林业大学": {
    "2025": {
      "普通类文史": {
        "count": "7",
        "score": "433",
        "rank": "2804"
      },
      "普通类理工": {
        "count": "14",
        "score": "465",
        "rank": "3706"
      }
    }
  },
  "昆明医科大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "515",
        "rank": "2776"
      }
    }
  },
  "云南中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "460",
        "rank": "2238"
      },
      "普通类理工": {
        "count": "7",
        "score": "483",
        "rank": "3415"
      }
    }
  },
  "云南师范大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "478",
        "rank": "1904"
      },
      "普通类理工": {
        "count": "2",
        "score": "499",
        "rank": "3114"
      },
      "预科文史": {
        "count": "1",
        "score": "449",
        "rank": "2485"
      },
      "预科理工": {
        "count": "0",
        "score": "0",
        "rank": "0"
      }
    }
  },
  "云南财经大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "454",
        "rank": "2377"
      },
      "普通类理工": {
        "count": "5",
        "score": "511",
        "rank": "2850"
      }
    }
  },
  "西北大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "523",
        "rank": "1144"
      }
    }
  },
  "西安交通大学": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "592",
        "rank": "304"
      },
      "普通类理工": {
        "count": "13",
        "score": "663",
        "rank": "133"
      }
    }
  },
  "西北工业大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "541",
        "rank": "856"
      },
      "普通类理工": {
        "count": "3",
        "score": "629",
        "rank": "542"
      }
    }
  },
  "西安电子科技大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "520",
        "rank": "1188"
      },
      "普通类理工": {
        "count": "13",
        "score": "619",
        "rank": "699"
      }
    }
  },
  "西安建筑科技大学": {
    "2025": {
      "普通类理工": {
        "count": "3",
        "score": "560",
        "rank": "1875"
      },
      "艺术类文史": {
        "count": "1",
        "score": "332",
        "rank": "4497"
      }
    }
  },
  "西安石油大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "462",
        "rank": "2195"
      },
      "普通类理工": {
        "count": "3",
        "score": "537",
        "rank": "2347"
      }
    }
  },
  "陕西科技大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "453",
        "rank": "2404"
      },
      "普通类理工": {
        "count": "6",
        "score": "541",
        "rank": "2285"
      }
    }
  },
  "长安大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "530",
        "rank": "1027"
      },
      "普通类理工": {
        "count": "3",
        "score": "585",
        "rank": "1340"
      }
    }
  },
  "西北农林科技大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "522",
        "rank": "1150"
      },
      "普通类理工": {
        "count": "3",
        "score": "577",
        "rank": "1516"
      }
    }
  },
  "陕西中医药大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "482",
        "rank": "3437"
      }
    }
  },
  "陕西师范大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "528",
        "rank": "1051"
      },
      "普通类理工": {
        "count": "4",
        "score": "572",
        "rank": "1631"
      }
    }
  },
  "延安大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "437",
        "rank": "2730"
      },
      "普通类理工": {
        "count": "12",
        "score": "460",
        "rank": "3784"
      }
    }
  },
  "陕西理工大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "437",
        "rank": "2714"
      },
      "普通类理工": {
        "count": "12",
        "score": "499",
        "rank": "3110"
      }
    }
  },
  "西安外国语大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "472",
        "rank": "2003"
      },
      "普通类理工": {
        "count": "8",
        "score": "507",
        "rank": "2943"
      }
    }
  },
  "西北政法大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "534",
        "rank": "959"
      }
    }
  },
  "西安音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "10",
        "score": "331",
        "rank": "4499"
      }
    }
  },
  "兰州大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "535",
        "rank": "944"
      },
      "普通类理工": {
        "count": "2",
        "score": "596",
        "rank": "1105"
      }
    }
  },
  "西北师范大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "464",
        "rank": "2155"
      },
      "普通类理工": {
        "count": "3",
        "score": "496",
        "rank": "3151"
      }
    }
  },
  "西北民族大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "432",
        "rank": "2819"
      },
      "普通类理工": {
        "count": "5",
        "score": "466",
        "rank": "3694"
      }
    }
  },
  "天津城建大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "451",
        "rank": "2430"
      },
      "普通类理工": {
        "count": "3",
        "score": "481",
        "rank": "3454"
      }
    }
  },
  "广东白云学院": {
    "2025": {
      "普通类文史": {
        "count": "15",
        "score": "447",
        "rank": "2523"
      },
      "普通类理工": {
        "count": "18",
        "score": "489",
        "rank": "3297"
      }
    }
  },
  "上海工程技术大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "485",
        "rank": "1804"
      },
      "普通类理工": {
        "count": "4",
        "score": "519",
        "rank": "2702"
      }
    }
  },
  "安徽建筑大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "486",
        "rank": "3355"
      }
    }
  },
  "枣庄学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "432",
        "rank": "2816"
      },
      "普通类理工": {
        "count": "3",
        "score": "475",
        "rank": "3549"
      }
    }
  },
  "湖北理工学院": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "432",
        "rank": "2832"
      },
      "普通类理工": {
        "count": "8",
        "score": "495",
        "rank": "3182"
      }
    }
  },
  "沈阳大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "440",
        "rank": "2668"
      },
      "普通类理工": {
        "count": "5",
        "score": "504",
        "rank": "3004"
      }
    }
  },
  "上海立信会计金融学院": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "497",
        "rank": "1580"
      },
      "普通类理工": {
        "count": "4",
        "score": "540",
        "rank": "2306"
      }
    }
  },
  "金陵科技学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "446",
        "rank": "2531"
      },
      "普通类理工": {
        "count": "2",
        "score": "463",
        "rank": "3730"
      }
    }
  },
  "常州工学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "453",
        "rank": "2390"
      },
      "普通类理工": {
        "count": "3",
        "score": "516",
        "rank": "2755"
      },
      "艺术类文史": {
        "count": "1",
        "score": "346",
        "rank": "4296"
      }
    }
  },
  "浙江科技大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "463",
        "rank": "2172"
      },
      "普通类理工": {
        "count": "6",
        "score": "543",
        "rank": "2229"
      },
      "艺术类文史": {
        "count": "2",
        "score": "422",
        "rank": "3013"
      },
      "艺术类理工": {
        "count": "1",
        "score": "474",
        "rank": "3565"
      }
    }
  },
  "厦门理工学院": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "471",
        "rank": "2019"
      },
      "普通类理工": {
        "count": "5",
        "score": "539",
        "rank": "2325"
      }
    }
  },
  "青岛大学": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "466",
        "rank": "2115"
      },
      "普通类理工": {
        "count": "8",
        "score": "519",
        "rank": "2698"
      }
    }
  },
  "烟台大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "452",
        "rank": "2413"
      },
      "普通类理工": {
        "count": "3",
        "score": "527",
        "rank": "2570"
      }
    }
  },
  "三峡大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "459",
        "rank": "2265"
      },
      "普通类理工": {
        "count": "6",
        "score": "555",
        "rank": "1982"
      }
    }
  },
  "广州大学": {
    "2025": {
      "普通类文史": {
        "count": "14",
        "score": "536",
        "rank": "934"
      },
      "普通类理工": {
        "count": "13",
        "score": "584",
        "rank": "1361"
      },
      "艺术类文史": {
        "count": "3",
        "score": "330",
        "rank": "4515"
      }
    }
  },
  "扬州大学": {
    "2025": {
      "普通类文史": {
        "count": "15",
        "score": "497",
        "rank": "1569"
      },
      "普通类理工": {
        "count": "5",
        "score": "569",
        "rank": "1694"
      },
      "预科文史": {
        "count": "1",
        "score": "453",
        "rank": "2387"
      },
      "预科理工": {
        "count": "1",
        "score": "511",
        "rank": "2861"
      }
    }
  },
  "中华女子学院": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "448",
        "rank": "2493"
      },
      "普通类理工": {
        "count": "1",
        "score": "491",
        "rank": "3259"
      }
    }
  },
  "南京审计大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "500",
        "rank": "1527"
      },
      "普通类理工": {
        "count": "3",
        "score": "572",
        "rank": "1636"
      }
    }
  },
  "龙岩学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "451",
        "rank": "2439"
      },
      "普通类理工": {
        "count": "2",
        "score": "511",
        "rank": "2860"
      }
    }
  },
  "福建商学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "461",
        "rank": "2230"
      },
      "普通类理工": {
        "count": "2",
        "score": "514",
        "rank": "2810"
      }
    }
  },
  "五邑大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "486",
        "rank": "1785"
      },
      "普通类理工": {
        "count": "10",
        "score": "538",
        "rank": "2339"
      }
    }
  },
  "北方民族大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "435",
        "rank": "2753"
      },
      "普通类理工": {
        "count": "10",
        "score": "488",
        "rank": "3308"
      }
    }
  },
  "中国矿业大学(北京)": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "514",
        "rank": "1286"
      },
      "普通类理工": {
        "count": "3",
        "score": "573",
        "rank": "1613"
      }
    }
  },
  "中国石油大学(北京)": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "538",
        "rank": "904"
      },
      "普通类理工": {
        "count": "4",
        "score": "590",
        "rank": "1225"
      }
    }
  },
  "中国地质大学(北京)": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "542",
        "rank": "840"
      },
      "普通类理工": {
        "count": "3",
        "score": "589",
        "rank": "1249"
      }
    }
  },
  "北京联合大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "471",
        "rank": "2014"
      },
      "普通类理工": {
        "count": "4",
        "score": "525",
        "rank": "2590"
      }
    }
  },
  "上海电机学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "439",
        "rank": "2672"
      },
      "普通类理工": {
        "count": "2",
        "score": "511",
        "rank": "2864"
      }
    }
  },
  "浙江财经大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "507",
        "rank": "1405"
      },
      "普通类理工": {
        "count": "4",
        "score": "568",
        "rank": "1709"
      }
    }
  },
  "莆田学院": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "452",
        "rank": "2408"
      }
    }
  },
  "山东交通学院": {
    "2025": {
      "普通类文史": {
        "count": "7",
        "score": "435",
        "rank": "2762"
      },
      "普通类理工": {
        "count": "3",
        "score": "471",
        "rank": "3611"
      }
    }
  },
  "武汉音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "5",
        "score": "401",
        "rank": "3461"
      }
    }
  },
  "湖南工业大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "462",
        "rank": "2188"
      },
      "普通类理工": {
        "count": "8",
        "score": "529",
        "rank": "2508"
      },
      "艺术类文史": {
        "count": "6",
        "score": "391",
        "rank": "3648"
      },
      "艺术类理工": {
        "count": "2",
        "score": "431",
        "rank": "4255"
      }
    }
  },
  "广东金融学院": {
    "2025": {
      "普通类文史": {
        "count": "20",
        "score": "494",
        "rank": "1632"
      },
      "普通类理工": {
        "count": "20",
        "score": "544",
        "rank": "2209"
      }
    }
  },
  "湖北经济学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "460",
        "rank": "2252"
      },
      "普通类理工": {
        "count": "3",
        "score": "508",
        "rank": "2931"
      }
    }
  },
  "北部湾大学": {
    "2025": {
      "普通类文史": {
        "count": "7",
        "score": "452",
        "rank": "2415"
      },
      "普通类理工": {
        "count": "3",
        "score": "513",
        "rank": "2831"
      }
    }
  },
  "宁波大学": {
    "2025": {
      "普通类文史": {
        "count": "33",
        "score": "510",
        "rank": "1346"
      },
      "普通类理工": {
        "count": "12",
        "score": "566",
        "rank": "1759"
      }
    }
  },
  "浙江传媒学院": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "511",
        "rank": "1336"
      },
      "普通类理工": {
        "count": "3",
        "score": "555",
        "rank": "1987"
      },
      "艺术类文史": {
        "count": "2",
        "score": "334",
        "rank": "4466"
      },
      "艺术类理工": {
        "count": "1",
        "score": "406",
        "rank": "4638"
      }
    }
  },
  "海南师范大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "470",
        "rank": "2034"
      },
      "普通类理工": {
        "count": "6",
        "score": "510",
        "rank": "2896"
      }
    }
  },
  "长春大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "430",
        "rank": "2862"
      },
      "普通类理工": {
        "count": "14",
        "score": "466",
        "rank": "3690"
      }
    }
  },
  "重庆工商大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "457",
        "rank": "2304"
      },
      "普通类理工": {
        "count": "2",
        "score": "500",
        "rank": "3077"
      }
    }
  },
  "东莞理工学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "498",
        "rank": "1556"
      },
      "普通类理工": {
        "count": "4",
        "score": "568",
        "rank": "1712"
      }
    }
  },
  "上海杉达学院": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "443",
        "rank": "2599"
      },
      "普通类理工": {
        "count": "5",
        "score": "480",
        "rank": "3469"
      }
    }
  },
  "上海政法学院": {
    "2025": {
      "普通类文史": {
        "count": "7",
        "score": "508",
        "rank": "1391"
      },
      "普通类理工": {
        "count": "3",
        "score": "556",
        "rank": "1958"
      }
    }
  },
  "浙江树人学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "446",
        "rank": "2539"
      },
      "普通类理工": {
        "count": "3",
        "score": "498",
        "rank": "3125"
      }
    }
  },
  "广东工业大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "527",
        "rank": "1078"
      },
      "普通类理工": {
        "count": "20",
        "score": "566",
        "rank": "1752"
      }
    }
  },
  "广东外语外贸大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "540",
        "rank": "877"
      },
      "普通类理工": {
        "count": "5",
        "score": "574",
        "rank": "1589"
      }
    }
  },
  "佛山大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "526",
        "rank": "1090"
      },
      "普通类理工": {
        "count": "4",
        "score": "566",
        "rank": "1749"
      }
    }
  },
  "大连民族大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "451",
        "rank": "2422"
      },
      "普通类理工": {
        "count": "5",
        "score": "504",
        "rank": "2998"
      }
    }
  },
  "上海第二工业大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "486",
        "rank": "1789"
      },
      "普通类理工": {
        "count": "3",
        "score": "548",
        "rank": "2131"
      }
    }
  },
  "南方医科大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "531",
        "rank": "1004"
      },
      "普通类理工": {
        "count": "5",
        "score": "580",
        "rank": "1455"
      }
    }
  },
  "中国劳动关系学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "440",
        "rank": "2666"
      },
      "普通类理工": {
        "count": "2",
        "score": "491",
        "rank": "3247"
      }
    }
  },
  "广州城市理工学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "457",
        "rank": "2320"
      },
      "普通类理工": {
        "count": "3",
        "score": "505",
        "rank": "2990"
      }
    }
  },
  "广州软件学院": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "437",
        "rank": "2722"
      },
      "普通类理工": {
        "count": "6",
        "score": "502",
        "rank": "3033"
      }
    }
  },
  "广州华商学院": {
    "2025": {
      "普通类文史": {
        "count": "15",
        "score": "440",
        "rank": "2652"
      },
      "普通类理工": {
        "count": "23",
        "score": "482",
        "rank": "3439"
      },
      "艺术类文史": {
        "count": "7",
        "score": "347",
        "rank": "4290"
      }
    }
  },
  "厦门医学院": {
    "2025": {
      "普通类理工": {
        "count": "20",
        "score": "488",
        "rank": "3317"
      }
    }
  },
  "上海建桥学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "453",
        "rank": "2391"
      },
      "普通类理工": {
        "count": "3",
        "score": "476",
        "rank": "3528"
      }
    }
  },
  "泉州职业技术大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "431",
        "rank": "2840"
      },
      "普通类理工": {
        "count": "11",
        "score": "464",
        "rank": "3727"
      }
    }
  },
  "福州工商学院": {
    "2025": {
      "普通类文史": {
        "count": "9",
        "score": "437",
        "rank": "2728"
      },
      "普通类理工": {
        "count": "16",
        "score": "467",
        "rank": "3689"
      }
    }
  },
  "西安思源学院": {
    "2025": {
      "普通类文史": {
        "count": "15",
        "score": "430",
        "rank": "2869"
      },
      "普通类理工": {
        "count": "15",
        "score": "460",
        "rank": "3790"
      }
    }
  },
  "山东工程职业技术大学": {
    "2025": {
      "普通类文史": {
        "count": "10",
        "score": "430",
        "rank": "2860"
      },
      "普通类理工": {
        "count": "10",
        "score": "460",
        "rank": "3778"
      }
    }
  },
  "阳光学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "443",
        "rank": "2595"
      },
      "普通类理工": {
        "count": "3",
        "score": "462",
        "rank": "3760"
      }
    }
  },
  "集美大学诚毅学院": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "445",
        "rank": "2560"
      },
      "普通类理工": {
        "count": "13",
        "score": "484",
        "rank": "3379"
      }
    }
  },
  "上海视觉艺术学院": {
    "2025": {
      "艺术类文史": {
        "count": "5",
        "score": "374",
        "rank": "3899"
      },
      "艺术类理工": {
        "count": "1",
        "score": "395",
        "rank": "4784"
      }
    }
  },
  "广州华立学院": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "439",
        "rank": "2680"
      },
      "普通类理工": {
        "count": "5",
        "score": "492",
        "rank": "3224"
      },
      "艺术类文史": {
        "count": "2",
        "score": "342",
        "rank": "4371"
      },
      "艺术类理工": {
        "count": "1",
        "score": "424",
        "rank": "4376"
      }
    }
  },
  "珠海科技学院": {
    "2025": {
      "普通类文史": {
        "count": "24",
        "score": "456",
        "rank": "2340"
      },
      "普通类理工": {
        "count": "31",
        "score": "509",
        "rank": "2922"
      }
    }
  },
  "广州工商学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "453",
        "rank": "2402"
      },
      "普通类理工": {
        "count": "3",
        "score": "479",
        "rank": "3489"
      }
    }
  },
  "广东科技学院": {
    "2025": {
      "普通类文史": {
        "count": "11",
        "score": "438",
        "rank": "2699"
      },
      "普通类理工": {
        "count": "11",
        "score": "487",
        "rank": "3346"
      }
    }
  },
  "广东理工学院": {
    "2025": {
      "普通类文史": {
        "count": "12",
        "score": "438",
        "rank": "2703"
      },
      "普通类理工": {
        "count": "18",
        "score": "484",
        "rank": "3388"
      }
    }
  },
  "福州外语外贸学院": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "440",
        "rank": "2659"
      },
      "普通类理工": {
        "count": "6",
        "score": "479",
        "rank": "3480"
      }
    }
  },
  "福建江夏学院": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "464",
        "rank": "2154"
      },
      "普通类理工": {
        "count": "3",
        "score": "503",
        "rank": "3012"
      }
    }
  },
  "东莞城市学院": {
    "2025": {
      "普通类文史": {
        "count": "9",
        "score": "442",
        "rank": "2617"
      },
      "普通类理工": {
        "count": "13",
        "score": "481",
        "rank": "3449"
      },
      "艺术类文史": {
        "count": "1",
        "score": "372",
        "rank": "3929"
      }
    }
  },
  "山东外事职业大学": {
    "2025": {
      "普通类文史": {
        "count": "4",
        "score": "431",
        "rank": "2855"
      },
      "普通类理工": {
        "count": "1",
        "score": "516",
        "rank": "2762"
      }
    }
  },
  "广州新华学院": {
    "2025": {
      "普通类文史": {
        "count": "7",
        "score": "449",
        "rank": "2475"
      },
      "普通类理工": {
        "count": "8",
        "score": "493",
        "rank": "3215"
      }
    }
  },
  "北京第二外国语学院中瑞酒店管理学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "432",
        "rank": "2833"
      },
      "普通类理工": {
        "count": "3",
        "score": "462",
        "rank": "3754"
      }
    }
  },
  "浙江外国语学院": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "470",
        "rank": "2043"
      },
      "普通类理工": {
        "count": "2",
        "score": "505",
        "rank": "2980"
      }
    }
  },
  "南方科技大学": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "633",
        "rank": "477"
      }
    }
  },
  "中国科学院大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "672",
        "rank": "69"
      }
    }
  },
  "河北中医药大学": {
    "2025": {
      "普通类文史": {
        "count": "6",
        "score": "463",
        "rank": "2186"
      },
      "普通类理工": {
        "count": "5",
        "score": "462",
        "rank": "3762"
      }
    }
  },
  "浙江音乐学院": {
    "2025": {
      "艺术类文史": {
        "count": "6",
        "score": "338",
        "rank": "4426"
      }
    }
  },
  "西湖大学": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "643",
        "rank": "327"
      }
    }
  },
  "香港城市大学(东莞)": {
    "2025": {
      "普通类理工": {
        "count": "20",
        "score": "598",
        "rank": "1072"
      }
    }
  },
  "宁波诺丁汉大学": {
    "2025": {
      "普通类文史": {
        "count": "2",
        "score": "588",
        "rank": "335"
      },
      "普通类理工": {
        "count": "3",
        "score": "563",
        "rank": "1814"
      }
    }
  },
  "西交利物浦大学": {
    "2025": {
      "普通类文史": {
        "count": "3",
        "score": "520",
        "rank": "1194"
      },
      "普通类理工": {
        "count": "7",
        "score": "578",
        "rank": "1505"
      }
    }
  },
  "北师香港浸会大学": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "530",
        "rank": "1024"
      },
      "普通类理工": {
        "count": "9",
        "score": "583",
        "rank": "1393"
      }
    }
  },
  "上海纽约大学": {
    "2025": {
      "普通类理工": {
        "count": "1",
        "score": "646",
        "rank": "295"
      }
    }
  },
  "温州肯恩大学": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "461",
        "rank": "2220"
      },
      "普通类理工": {
        "count": "11",
        "score": "507",
        "rank": "2946"
      }
    }
  },
  "昆山杜克大学": {
    "2025": {
      "普通类文史": {
        "count": "1",
        "score": "542",
        "rank": "854"
      },
      "普通类理工": {
        "count": "1",
        "score": "575",
        "rank": "1548"
      }
    }
  },
  "香港中文大学(深圳)": {
    "2025": {
      "普通类文史": {
        "count": "8",
        "score": "602",
        "rank": "232"
      },
      "普通类理工": {
        "count": "12",
        "score": "634",
        "rank": "463"
      }
    }
  },
  "深圳北理莫斯科大学": {
    "2025": {
      "普通类文史": {
        "count": "11",
        "score": "479",
        "rank": "1881"
      },
      "普通类理工": {
        "count": "66",
        "score": "517",
        "rank": "2748"
      }
    }
  },
  "广东以色列理工学院": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "526",
        "rank": "2575"
      }
    }
  },
  "香港科技大学(广州)": {
    "2025": {
      "普通类理工": {
        "count": "10",
        "score": "643",
        "rank": "331"
      }
    }
  },
  "北京大学医学部": {
    "2025": {
      "普通类理工": {
        "count": "5",
        "score": "679",
        "rank": "34"
      }
    }
  },
  "北京师范大学(珠海校区)": {
    "2025": {
      "普通类文史": {
        "count": "5",
        "score": "607",
        "rank": "201"
      },
      "普通类理工": {
        "count": "5",
        "score": "623",
        "rank": "627"
      }
    }
  }
};
